emacs_company.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-12-05 Sun 16:54 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs - Company</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs - Company</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1ebcc5f">Introduction</a></li>
<li><a href="#org4ae46bf">Installation and configuration</a>
<ul>
<li><a href="#orgb040b77">Company</a></li>
<li><a href="#org5181bdd">Clang support</a></li>
<li><a href="#orgd4f1f52">C headers support</a></li>
<li><a href="#orgd824bf6">LaTeX support</a></li>
<li><a href="#org6381296">Python support</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1ebcc5f" class="outline-2">
<h2 id="org1ebcc5f">Introduction</h2>
<div class="outline-text-2" id="text-org1ebcc5f">
<p>
<i>Auto-completion</i> is an important functionality in Emacs. It can greatly speed up our editing and programming. Generally speaking, the auto-completion can be divided into two parts, <i>frontend</i> and <i>backend</i>. As their names indicate, the former presents interface, while the latter provides contents. In a nutshell, the backend generates completion contents and feeds them to the frontend; then the frontend presents completion candidates to us for selection.
</p>

<p>
Up to now, there are a couple of popular frontends, <code>auto-complete</code><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> and <code>company</code><sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>. The word "company" stands for "complete anything". In fact, their functionalities are very similar. Both of them work well and their developments are fairly active. Both of them come with a variety of built-in backends. What's more, you can customize your own backends for your special requirements.
</p>

<p>
It should be noticed that each of the both above provides backend for C/C++ programming, e.g. <code>company-clang</code> is a powerful backend based on <code>clang</code>. It enables company completing based on the semantic analysis provided by clang. With the aid of this backend, the programming experience and efficiency can be remarkably improved.
</p>

<p>
For myself, I have been using company since I began to use Emacs. Therefore, I just summarize the installation and configuration of company in this post.
</p>
</div>
</div>
<div id="outline-container-org4ae46bf" class="outline-2">
<h2 id="org4ae46bf">Installation and configuration</h2>
<div class="outline-text-2" id="text-org4ae46bf">
</div>
<div id="outline-container-orgb040b77" class="outline-3">
<h3 id="orgb040b77">Company</h3>
<div class="outline-text-3" id="text-orgb040b77">
<p>
Company can be directly installed via <i>ELPA</i>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">M-x package-install
company
</pre>
</div>
<p>
After the installation, following configurations should be added in <code>~/.emacs</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; enable global company mode
(add-hook 'after-init-hook 'global-company-mode)

;; completion immediately
(setq company-idle-delay 0)

;; move the selection to the next/previous candidate using C-n/p instead of M-n/p
(with-eval-after-load 'company
  (define-key company-active-map (kbd "M-n") nil)
  (define-key company-active-map (kbd "M-p") nil)
  (define-key company-active-map (kbd "C-n") #'company-select-next)
  (define-key company-active-map (kbd "C-p") #'company-select-previous))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5181bdd" class="outline-3">
<h3 id="org5181bdd">Clang support</h3>
<div class="outline-text-3" id="text-org5181bdd">
<p>
Clang support is out-of-the-box. Additional package installation is not necessary. However, company-semantic is also built-in and precedes company-clang. Therefore, it is necessary to remove company-semantic. To this end, following configurations are needed.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; remove company-semantic from company-backends.
(setq company-backends (delete 'company-semantic company-backends))

;; make company-clang find IT++ headers and support c++11.
(setq company-clang-arguments (quote ("-I/opt/itpp/include/" "-std=c++14")))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd4f1f52" class="outline-3">
<h3 id="orgd4f1f52">C headers support</h3>
<div class="outline-text-3" id="text-orgd4f1f52">
<p>
For the sake of completing C/C++ header files while input, package <code>company-c-headers</code> can be installed by
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">M-x package-install
company-c-headers
</pre>
</div>
<p>
and configured by
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'company-backends 'company-c-headers)
(setq company-c-headers-path-system (quote ("/usr/include/" "/usr/local/include/" "/usr/include/c++/6.1.1/" "/opt/itpp/include/")))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd824bf6" class="outline-3">
<h3 id="orgd824bf6">LaTeX support</h3>
<div class="outline-text-3" id="text-orgd824bf6">
<p>
In order to enjoy the completion in LaTeX composition, package <code>company-auctex</code> can be installed<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">M-x package-install
company-auctex
</pre>
</div>
<p>
Accordingly, append the following line to the configuration of company in <code>~/.emacs</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; enable company backends for LaTeX (based on AucTeX)
(company-auctex-init)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6381296" class="outline-3">
<h3 id="org6381296">Python support</h3>
<div class="outline-text-3" id="text-org6381296">
<p>
Targetting for Python support, package <code>company-jedi</code> needs to be installed.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">M-x package-install
company-jedi
</pre>
</div>
<p>
Likewise, add following lines to the configuration of company in <code>~/.emacs</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'company-backends 'company-jedi)
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://github.com/auto-complete/auto-complete">https://github.com/auto-complete/auto-complete</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://github.com/company-mode/company-mode">https://github.com/company-mode/company-mode</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<i>AucTeX</i> will also be installed as a dependency.
</p></div></div>


</div>
</div></div>
</body>
</html>
